# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [55]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [56]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [57]:
# Count by hand. (lol kidding) #the shape is the amount of rows and columns
df_food_shape = df_food.shape
df_food_shape

(125, 61)

What are the columns and their types in this data set?

In [58]:
# Show the column names and their types.
for col, dtype in df_food.dtypes.items():
    print(f'Column: {col}, Type: {dtype}')

Column: GPA, Type: object
Column: Gender, Type: int64
Column: breakfast, Type: int64
Column: calories_chicken, Type: int64
Column: calories_day, Type: float64
Column: calories_scone, Type: float64
Column: coffee, Type: int64
Column: comfort_food, Type: object
Column: comfort_food_reasons, Type: object
Column: comfort_food_reasons_coded, Type: float64
Column: cook, Type: float64
Column: comfort_food_reasons_coded.1, Type: int64
Column: cuisine, Type: float64
Column: diet_current, Type: object
Column: diet_current_coded, Type: int64
Column: drink, Type: float64
Column: eating_changes, Type: object
Column: eating_changes_coded, Type: int64
Column: eating_changes_coded1, Type: int64
Column: eating_out, Type: int64
Column: employment, Type: float64
Column: ethnic_food, Type: int64
Column: exercise, Type: float64
Column: father_education, Type: float64
Column: father_profession, Type: object
Column: fav_cuisine, Type: object
Column: fav_cuisine_coded, Type: int64
Column: fav_food, Type: float64
Column: food_childhood, Type: object
Column: fries, Type: int64
Column: fruit_day, Type: int64
Column: grade_level, Type: int64
Column: greek_food, Type: int64
Column: healthy_feeling, Type: int64
Column: healthy_meal, Type: object
Column: ideal_diet, Type: object
Column: ideal_diet_coded, Type: int64
Column: income, Type: float64
Column: indian_food, Type: int64
Column: italian_food, Type: int64
Column: life_rewarding, Type: float64
Column: marital_status, Type: float64
Column: meals_dinner_friend, Type: object
Column: mother_education, Type: float64
Column: mother_profession, Type: object
Column: nutritional_check, Type: int64
Column: on_off_campus, Type: float64
Column: parents_cook, Type: int64
Column: pay_meal_out, Type: int64
Column: persian_food, Type: float64
Column: self_perception_weight, Type: float64
Column: soup, Type: float64
Column: sports, Type: float64
Column: thai_food, Type: int64
Column: tortilla_calories, Type: float64
Column: turkey_calories, Type: int64
Column: type_sports, Type: object
Column: veggies_day, Type: int64
Column: vitamins, Type: int64
Column: waffle_calories, Type: int64
Column: weight, Type: object

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [59]:
# Remove ‚Äòem.
df_food_clean = df_food[['calories_day', 'weight','Gender']]

What about `NaN`s? How many are there?

In [60]:
# Count ‚Äòem.
nan_num = df_food_clean.isna().sum()
nan_num

calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [61]:
# Drop ‚Äòem.
df_food_clean = df_food_clean.dropna()

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [62]:
# Fix that.
df_food_clean['calories_day'] = pd.to_numeric(df_food_clean['calories_day'], errors = 'coerce')

df_food_clean = df_food_clean.dropna(subset=['calories_day'])

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [63]:
# Savey save!
df_food_clean.to_csv('cleaned_food_data.csv', index=False)

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [64]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('data/Ask_A_Manager_Salary_Survey_2021_(Responses)_Form_Responses_1.tsv', sep='\t')

df_salary.head()

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

Was that hard? üôÉ

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [65]:
# Count by hand. I‚Äôm dead serious.
df_salary_shape = df_salary.shape
df_salary_shape

(28062, 18)

What are the columns and their types?

In [66]:
# Show the column names and their types.
# Remove leading/trailing spaces from column names
df_salary.columns = df_salary.columns.str.strip()

for col, dtype in df_salary.dtypes.items():
    print(f'Column: {col}, Type: {dtype}')

Column: Timestamp, Type: object
Column: How old are you?, Type: object
Column: What industry do you work in?, Type: object
Column: Job title, Type: object
Column: If your job title needs additional context, please clarify here:, Type: object
Column: What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.), Type: object
Column: How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits., Type: float64
Column: Please indicate the currency, Type: object
Column: If "Other," please indicate the currency here:, Type: object
Column: If your income needs additional context, please provide it here:, Type: object
Column: What country do you work in?, Type: object
Column: If you're in the U.S., what state do you work in?, Type: object
Column: What city do you work in?, Type: object
Column: How many years of professional work experience do you have overall?, Type: object
Column: How many years of professional work experience do you have in your field?, Type: object
Column: What is your highest level of education completed?, Type: object
Column: What is your gender?, Type: object
Column: What is your race? (Choose all that apply.), Type: object

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [67]:
# Rename ‚Äòem.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race
# Rename columns in the df_salary DataFrame
rename_col = ['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_compensation', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_education_completed', 'gender', 'race']
df_salary.columns = rename_col
print(df_salary.columns)

Index(['timestamp', 'age', 'industry', 'title', 'title_context', 'salary',
       'additional_compensation', 'currency', 'other_currency',
       'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe',
       'highest_education_completed', 'gender', 'race'],
      dtype='object')

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [68]:
# List the unique industries and a count of their instances.
# List unique industries and their counts
# Print the column names to verify
# List unique industries and their counts
industry_counts = df_salary['industry'].value_counts()
industry_counts

industry
Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [69]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
# Filter for tech industry
df_salary_tech = df_salary[df_salary['industry'] == 'Computing or Tech']

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [70]:
# Sanity Check 
# Check if the industry column contains only 'Computing/Tech'
# Strip whitespace and ensure all industry values are in a consistent case

# Sanity check again
print(df_salary_tech['industry'].unique())

['Computing or Tech']

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [71]:
# Filtery filter for just the jobs that pay in USD!
# Filter for jobs that pay in USD
df_salary_usd = df_salary[df_salary['currency'] == 'USD']
print(df_salary_usd.head())

            timestamp    age                       industry  \
0  4/27/2021 11:02:10  25-34   Education (Higher Education)
2  4/27/2021 11:02:38  25-34  Accounting, Banking & Finance
3  4/27/2021 11:02:41  25-34                     Nonprofits
4  4/27/2021 11:02:42  25-34  Accounting, Banking & Finance
5  4/27/2021 11:02:46  25-34   Education (Higher Education)

                                title title_context  salary  \
0  Research and Instruction Librarian           NaN  55,000
2                Marketing Specialist           NaN  34,000
3                     Program Manager           NaN  62,000
4                  Accounting Manager           NaN  60,000
5      Scholarly Publishing Librarian           NaN  62,000

   additional_compensation currency other_currency salary_context  \
0                      0.0      USD            NaN            NaN
2                      NaN      USD            NaN            NaN
3                   3000.0      USD            NaN            NaN
4                   7000.0      USD            NaN            NaN
5                      NaN      USD            NaN            NaN

         country           state         city     total_yoe    field_yoe  \
0  United States   Massachusetts       Boston     5-7 years    5-7 years
2             US       Tennessee  Chattanooga   2 - 4 years  2 - 4 years
3            USA       Wisconsin    Milwaukee  8 - 10 years    5-7 years
4             US  South Carolina   Greenville  8 - 10 years    5-7 years
5            USA   New Hampshire      Hanover  8 - 10 years  2 - 4 years

  highest_education_completed gender   race
0             Master's degree  Woman  White
2              College degree  Woman  White
3              College degree  Woman  White
4              College degree  Woman  White
5             Master's degree    Man  White

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [72]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
# Count occurrences of each country
country_full_count = df_salary_usd['country'].value_counts()
print(country_full_count)

country
United States                                8989
USA                                          7922
US                                           2606
United States                                 667
U.S.                                          580
                                             ...
Cote d'Ivoire                                   1
From Romania, but for an US based company       1
Somalia                                         1
Norway                                          1
Burma                                           1
Name: count, Length: 229, dtype: int64

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [85]:
# Replace them all with 'US'.
# Replace various forms of the United States with 'US'
# Replace various forms of the United States with 'US'
df_salary_usd.loc[:, 'country'] = df_salary_usd['country'].replace({
    'United States': 'US',
    'USA': 'US',
    'U.S.': 'US',
    'America': 'US'
})

Have a look at the count of each unique country again now.

In [86]:
# Count again.
# Check the updated count of unique country values
country_counts_updated = df_salary_usd['country'].value_counts()
print(country_counts_updated)

country
US                          5364
United States                237
Usa                          185
USA                          179
United States of America     129
                            ...
Belgium                        1
uS                             1
united states                  1
Switzerland                    1
Burma                          1
Name: count, Length: 114, dtype: int64

Did you notice anything interesting?

In [75]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.

In [76]:

# BONUS CREDIT: if you‚Äôve resolved it, let‚Äôs see how well you did by counting the number of instances of each unique value.

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [87]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
# Group by state and calculate min, mean, and max salary
# Convert the 'salary' column to numeric, coerce invalid values to NaN
# Convert the 'salary' column to numeric using .loc to avoid the warning
# Group by state and calculate min, mean, and max salary
salary_stats_by_state = df_salary_usd.groupby('state')['salary'].agg(['min', 'mean', 'max'])

# Sort by mean salary in descending order
salary_stats_by_state_sorted = salary_stats_by_state.sort_values(by='mean', ascending=False)

# Display the result
salary_stats_by_state_sorted


#shows output because i ran it again after making it numeric

                                        min       mean         max
state
Alabama, South Carolina           5000000.0  5000000.0   5000000.0
Alaska                              47840.0   737319.2  10000000.0
Michigan, Texas, Washington        340000.0   340000.0    340000.0
California, Oregon                 200000.0   200000.0    200000.0
California, Colorado               176000.0   176000.0    176000.0
...                                     ...        ...         ...
District of Columbia, Washington    35000.0    35000.0     35000.0
Delaware, Pennsylvania              35000.0    35000.0     35000.0
Alabama, California                 29120.0    29120.0     29120.0
Maryland, New York                  14000.0    14000.0     14000.0
Alabama, Alaska, Arizona               15.0       15.0        15.0

[83 rows x 3 columns]

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [88]:
# Fix it.
# Convert the 'salary' column to numeric, coerce invalid values to NaN
df_salary_usd['salary'] = pd.to_numeric(df_salary_usd['salary'], errors='coerce')

# Drop rows where salary is NaN (if needed)
df_salary_usd = df_salary_usd.dropna(subset=['salary'])

Let‚Äôs try that again.

In [82]:
# Try it again. Yeah!
# Group by state and calculate min, mean, and max salary
salary_stats_by_state = df_salary_usd.groupby('state')['salary'].agg(['min', 'mean', 'max'])

# Sort by mean salary in descending order
salary_stats_by_state_sorted = salary_stats_by_state.sort_values(by='mean', ascending=False)

# Display the result
salary_stats_by_state_sorted

                                        min       mean         max
state
Alabama, South Carolina           5000000.0  5000000.0   5000000.0
Alaska                              47840.0   737319.2  10000000.0
Michigan, Texas, Washington        340000.0   340000.0    340000.0
California, Oregon                 200000.0   200000.0    200000.0
California, Colorado               176000.0   176000.0    176000.0
...                                     ...        ...         ...
District of Columbia, Washington    35000.0    35000.0     35000.0
Delaware, Pennsylvania              35000.0    35000.0     35000.0
Alabama, California                 29120.0    29120.0     29120.0
Maryland, New York                  14000.0    14000.0     14000.0
Alabama, Alaska, Arizona               15.0       15.0        15.0

[83 rows x 3 columns]

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [84]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
# Convert 'timestamp' to datetime format
df_salary_usd['timestamp'] = pd.to_datetime(df_salary_usd['timestamp'], errors='coerce')

# Filter for entries in 2021 and 2022
df_filtered = df_salary_usd[df_salary_usd['timestamp'].dt.year.isin([2021, 2022])]

# Verify the filtered DataFrame
df_filtered.head()

# Calculate min, mean, max salary by state for filtered data (2021-2022)
salary_stats_by_state_filtered = df_filtered.groupby('state')['salary'].agg(['min', 'mean', 'max']).sort_values(by='mean', ascending=False)

# Display the result
salary_stats_by_state_filtered

                                       min           mean       max
state
Michigan, Texas, Washington       340000.0  340000.000000  340000.0
California, Oregon                200000.0  200000.000000  200000.0
California, Colorado              176000.0  176000.000000  176000.0
New Jersey, New York              135000.0  138666.666667  141000.0
Indiana, Massachusetts            132000.0  132000.000000  132000.0
...                                    ...            ...       ...
South Dakota                       33000.0   46625.000000   60000.0
District of Columbia, Washington   35000.0   35000.000000   35000.0
Delaware, Pennsylvania             35000.0   35000.000000   35000.0
Alabama, California                29120.0   29120.000000   29120.0
Maryland, New York                 14000.0   14000.000000   14000.0

[81 rows x 3 columns]

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)